<template>
  <v-layout
    white
    row
    wrap
  >
    <!-- loading -->
    <v-flex v-if="isRefreshing == null || isRefreshing" xs12 py-5>
      <v-layout justify-center>
        Now Loading...
      </v-layout>
    </v-flex>
    <v-flex
      v-else
      sm8
      xs12
      offset-sm2
      :class="{'pa-3': $vuetify.breakpoint.xsOnly}"
    >
      <div class="display-1 font-weight-bold text-color py-4 hidden-xs-only">
        利用規約
      </div>
      <div class="text-color">
        本規約は、株式会社 Liplo（以下「当社」といいます）が提供する全てのサービス
        （以下「本サービス」といいます）の利用条件を定めるものであり、
        本サービスを利用する全てのユーザーに適用されます。以下を注意してお読みください。
        <div class="subheading font-weight-bold text-color pt-5">
          1. 本規約への同意
        </div>
        <div class="text-color pt-3">
          お客様は、本サービスを利用することにより、本規約に同意したことになります。
          本規約に同意しないお客様は、本サービスを利用しないでください。
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          2. 定義
        </div>
        <div class="text-color pt-3">
          本規約の中で使用される以下の各用語は、それぞれ以下の意味を有するものとします。
          <ol>
            <li class="pt-3 pl-2">
              「ユーザー」とは、本サービスで所定の会員登録手続を行って当社から登録の承諾を受けた利用者を指します
            </li>
            <li class="pt-1 pl-2">
              「掲載企業」とは、本サービスに採用活動に関する情報を掲載する企業・団体等を指します
            </li>
            <li class="pt-1 pl-2">
              「候補者」とは、掲載企業の選考中のユーザーを指します
            </li>
            <li class="pt-1 pl-2">
              「利用者情報」とは、氏名、メールアドレス、プロフィール画像、学歴、
              年齢などユーザーが本サービスの会員登録に際して又は本サービスの利用に際して当社に提供するすべての情報を指します
            </li>
          </ol>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          3. 改定
        </div>
        <div class="text-color pt-3">
          当社は、必要に応じて本規約を改定することができるものとします。
          本規約の改定はこのページに表示します。
          本規約の改定後にユーザーが対象となる本サービスを利用された場合、
          当該改定は当社とユーザーとの間の契約の一部となります。改定に同意しないユーザーは、
          本サービスの利用を中止してください。
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          4. サービスの変更・終了
        </div>
        <div class="text-color pt-3">
          当社は、ユーザーにあらかじめ通知することなく、いつでも、
          本サービスの内容や仕様を変更したり、本サービスを一時停止または終了したりすることができます。
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          5. サービスの利用制限
        </div>
        <div class="text-color pt-3">
          ユーザーが未成年である場合、事前に法定代理人の同意を得て利用しなければなりません。
          当社は、法定代理人に対して、同意の有無を確認する場合がございます。
          <div class="pt-3">
            また、当社は、反社会的勢力の構成員（過去に構成員であった方を含みます）
            およびその関係者の方や、サービスを悪用したり、
            第三者に迷惑をかけたりするようなユーザーに対してはご利用をお断りしています。
          </div>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          6. アカウント
        </div>
        <div class="text-color pt-3">
          本サービスを利用するためにアカウントが必要になる場合があります。
          アカウントは、ユーザー自身で作成してください。
          <div class="pt-3">
            アカウントを作成していただく場合、
            （1）真実かつ正確な情報を登録していただくこと、
            （2）登録内容が最新となるようユーザーご自身で適宜修正していただくことがユーザーの義務となります。
          </div>
          <div class="pt-3">
            アカウントを保護するため、パスワードは他人に知らせないでください。
            アカウントを通じて行われた行為の責任はユーザー自身にあります。
            当社は、アカウントを通じて行われた行為をユーザー自身の行為とみなすことができます。
          </div>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          7. ユーザーのデータおよびコンテンツの取扱い
        </div>
        <div class="text-color pt-3">
          当社は、ユーザーのデータについてバックアップを行う義務を負いません。
          必要なバックアップはユーザーご自身で行ってください。
          <div class="pt-3">
            ユーザーが本サービスに提供したコンテンツ（文章、写真、ポートフォリオ等を含みますが、
            これらに限られません。以下同じ）に対する権利はユーザーに帰属します。
            ただし、当社がユーザーに代わって作成したコンテンツに対する権利は当社に帰属します。
          </div>
          <div class="pt-3">
            ユーザーは、当社が利用者情報を本サービスの提供に必要な範囲で、他の利用者、
            掲載企業に公開することを予め同意するものとします。ユーザーは、
            利用者情報として送信された情報の公開について単独で責任を負います。
            なお、ユーザーが公開を欲しない個人情報については、本サービスに書き込まないようご注意ください。
          </div>
          <div class="pt-3">
            ユーザーは、当社または当社のビジネスパートナーが、ユーザーが投稿したコンテンツを、
            無償で、地域、回数および期間の制限なく、利用（複製、上映、公衆送信、展示、頒布、
            譲渡、貸与、翻訳、翻案、出版を含みます）することを、非独占的に許諾し、
            そのような利用について異議を述べないものとします。
          </div>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          8. 利用履歴等の閲覧及び利用
        </div>
        <div class="text-color pt-3">
          当社は、ユーザーの本サービスの利用履歴（ページビュー、応募履歴等）、
          利用者情報等を個人を識別、特定できないように加工、集計、及び分析した統計データ、
          属性情報等を作成し、それらを制限なく閲覧、利用することができるものとし、
          ユーザーはこれを予め承諾するものとします。
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          9. 評価及びレビュー
        </div>
        <div class="text-color pt-3">
          インターン終了後、ユーザーは、掲載企業について公開レビュー
          (以下「レビュー」といいます)及び星評価(以下「評価」といいます)を行うことができます。
          評価又はレビューはユーザー個人の意見を反映しており、当社の意見を反映したものではありません。
          評価及びレビューは、当社によりその正確さを検証されたものではなく、
          不正確又は誤解を招くものである可能性があります。
          <div class="pt-3">
            ユーザーによる評価及びレビューは正確でなければならず、
            攻撃的又は中傷的な表現を含んではならないものとします。
          </div>
          <div class="pt-3">
            ユーザーは、掲載企業に関し好意的又は否定的な評価を書くことを第三者に対し指示するなど、
            いかなる方法においても評価及びレビューを操作してならないものとします。
          </div>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          10. パスの発行
        </div>
        <div class="text-color pt-3">
          候補者のインターン終了後、掲載企業は、候補者に対して、
          企業に入社する権利や内定を受けることができる権利(以下「パス」といいます)
          を与えることができます。パスは、掲載企業の判断で発行されるものであり、
          当社の判断が関与しているものではありません。
          <div class="pt-3">
            パスの発行時、掲載企業から労働条件が提示された場合でも、
            労働条件は、時間の経過と共に変更される可能性があるものであり、
            ユーザーはこれを予め承諾するものとします。
            パスを使用する際など、適宜確認をしてください。
            また、労働条件の変更などによって生じたトラブル、紛争等について、
            当社は一切責任を負いませんのでご注意ください。
          </div>
          <div class="pt-3">
            パスを発行した掲載企業は、候補者に対して発行したパスの効力、つまり、
            掲載企業に入社する権利や内定を受けることができる権利を保証するものとします。
            これらの権利を保証することができない場合のパスの発行は禁止します。
          </div>
          <div class="pt-3">
            万一、掲載企業が、候補者に対してパスを発行したにも関わらず、パスの使用を拒否
            （入社や内定を拒否）した場合、責任は全て掲載企業が負うものとし、
            対価の請求や損害賠償請求等があった場合には、
            弁護士費用等を含めて掲載企業の費用で処理されるものとします。
          </div>
          <div class="pt-3">
            ただし、候補者が大学、大学院を無事に卒業できなかった場合や掲載企業に伝えていた経歴などに重大な嘘があった場合など、
            パスの取り消しが合理的であると認められるものであれば、
            パスの取り消しは可能であるものとし、ユーザーはこれを予め承諾するものとします。
          </div>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          11. パスの使用
        </div>
        <div class="text-color pt-3">
          候補者は、掲載企業から受け取ったパスを、有効期間内であればいつでも使用することが出来ます。
          <div class="pt-3">
            パスを使用した後の入社辞退などは原則禁止とします。
            他の企業に入社する可能性がある場合は、パスを使用しないようにご注意ください。
          </div>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          12. 秘密情報の取り扱い
        </div>
        <div class="text-color pt-3">
          本サービスを通じてユーザー間で連絡を取り合う場合、
          相手方から開示された情報については秘密として保持し、
          事前に当該相手方の書面による承諾を得ることなく第三者への開示又は漏洩をしてはならないものとします。
          <div class="pt-3">
            次の各号に定める情報は、秘密情報から除外します。
            <div>
              （1）開示者から開示を受ける前に、被開示者が正当に保有していたことを証明できる情報
            </div>
            <div>
              （2）開示者から開示を受ける前に、公知となっていた情報
            </div>
            <div>
              （3）開示者から開示を受けた後に、被開示者の責に帰すべからざる事由により公知となった情報
            </div>
            <div>
              （4）被開示者が、正当な権限を有する第三者から秘密保持義務を負うことなく正当に入手した情報
            </div>
            <div>
              （5）被開示者が、開示された情報によらず独自に開発した情報
            </div>
          </div>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          13. 禁止事項
        </div>
        <div class="text-color pt-3">
          本サービスのご利用に際しては、以下に定める行為
          （それらを誘発する行為や準備行為も含みます）を禁止します。
          <ol>
            <li class="pt-3 pl-2">
              法令、本規約または追加規定に違反する行為
            </li>
            <li class="pt-1 pl-2">
              公序良俗に反する行為
            </li>
            <li class="pt-1 pl-2">
              当社または第三者の権利を侵害する行為
            </li>
            <li class="pt-1 pl-2">
              他のユーザーに対する嫌がらせ、誹謗中傷、ネットストーキング、差別の助長、
              その他、他のユーザーの迷惑となる行為
            </li>
            <li class="pt-1 pl-2">
              営業、宣伝、広告、勧誘、会員の募集など営利を目的とする行為
              （当社の認めたものを除きます）、面識のない異性との出会いや交際を目的とする行為、
              その他、本来予定している目的とは異なる目的で本サービスを利用する行為
            </li>
            <li class="pt-1 pl-2">
              当社または第三者のソフトウェア、ハードウェア、
              サーバまたはネットワークの機能を破壊したり、妨害したりする行為
            </li>
            <li class="pt-1 pl-2">
              他のユーザーの個人情報、登録情報、利用履歴などを無断で収集したり、
              収集した情報を第三者に開示しまたは本サービス以外での採用活動、
              ヘッドハンティングもしくは営業行為に利用したりする行為
            </li>
            <li class="pt-1 pl-2">
              他のユーザーのアカウントを使用して本サービスを利用する行為
            </li>
            <li class="pt-1 pl-2">
              自己のアカウントを第三者に譲渡または貸与したり、
              自己のアカウントのパスワードを第三者に開示したりする行為
            </li>
            <li class="pt-1 pl-2">
              本サービスに含まれるソフトウェアのソースコードのリバースエンジニアリングや抽出を試みる行為
            </li>
            <li class="pt-1 pl-2">
              本サービスを利用して、反社会的勢力に直接・間接に利益を提供する行為
            </li>
            <li class="pt-1 pl-2">
              ボット等の自動化プログラムを用いることによって、本サービスを不正に操作したり、
              他のユーザーの自主的かつ合理的な選択を妨げたりする行為
            </li>
            <li class="pt-1 pl-2">
              掲載企業の選考を受けることだけを目的として本サービスを利用し、
              その後の選考、パスの発行、採用などを本サービス外で進める行為
            </li>
          </ol>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          14. 違反等に対する措置
        </div>
        <div class="text-color pt-3">
          以下の場合、当社は、事前に通知することなく、ユーザーのデータ、コンテンツ、
          アカウントを削除したり、ユーザーへのサービス提供を停止したりすることができるものとします。
          また、ユーザーが複数のアカウントを登録されている場合には、
          すべてのアカウントに対して同様の措置がとられることがあります。
          <ol>
            <li class="pt-3 pl-2">
              ユーザーが本規約または適用ある追加規定に違反した場合、
              もしくはそのおそれがあると当社が判断した場合
            </li>
            <li class="pt-1 pl-2">
              アカウントが反社会的勢力またはその構成員や関係者によって登録または使用された場合、
              もしくはそのおそれがあると当社が判断した場合
            </li>
            <li class="pt-1 pl-2">
              その他、ユーザーとの信頼関係が失われた場合など、
              当社とユーザーとの契約関係の継続が困難であると当社が判断した場合
            </li>
          </ol>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          15. 当社に対する補償
        </div>
        <div class="text-color pt-3">
          ユーザーの行為が原因で生じたクレームなどにより、当社に損害
          （弁護士費用その他の費用負担や賠償金の支払いを含みます）が発生した場合、
          ユーザーは当社の損害を補償するものとします。
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          16. 非保証
        </div>
        <div class="text-color pt-3">
          本サービスは「現状有姿で」提供されます。本規約または追加規定に明示されている場合を除き、
          当社は、本サービスにエラーやバグ、誤り、不具合、中断、その他の瑕疵（かし）
          や権利侵害がないこと、また、本サービスの信頼性、正確性、完全性、特定の目的への適合性、
          有用性やセキュリティについて、一切の保証を行いません。
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          17. 免責
        </div>
        <div class="text-color pt-3">
          本サービスに関する当社の責任は、当社の故意または重過失によらない場合には免除されるものとします。
          また、当社は、現実に発生した直接かつ通常の範囲内の損害
          （逸失利益、間接損害、特別損害、懲罰的損害を含みません）に限り、
          損害賠償責任を負うことのほか、一切の責任を負わないものとします。
          上記の免責が消費者契約法その他の適用法令により無効とされる場合であっても、
          当社は、適用法令が許容する最大限の免責を受けるものとします。
          <div class="pt-3">
            当社は、掲載企業又はユーザーが表明する掲載企業に関する情報及び当社が提供する情報の真実性、
            最新性、確実性等について一切保証しないものとします。
          </div>
          <div class="pt-3">
            当社は、本サービスの利用に関して、ユーザーと、他のユーザー、募集主、候補者、
            その他の第三者との間で生じたトラブル、取引、紛争等について、一切責任を負いません。
          </div>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          18. 譲渡禁止
        </div>
        <div class="text-color pt-3">
          ユーザーは、当社との契約より生じる権利義務を、当社の承諾なく第三者に譲渡することはできません。
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          19. 連絡
        </div>
        <div class="text-color pt-3">
          本サービスに関するユーザーから当社への連絡は、
          当社が運営するウェブサイト内の適宜の場所に設置するお問い合わせフォームの送信または当社が指定する方法により行っていただきます。
          <div class="pt-3">
            本サービスに関する当社からユーザーへの連絡は、
            当社が運営するウェブサイト内の適宜の場所への掲示その他、当社が適当と判断する方法により行ないます。
          </div>
          <div class="pt-3">
            ユーザーは、当社が、当社または当社のビジネスパートナーに関する連絡、
            通知または宣伝等を、ユーザーが登録したメールアドレス宛に送信する可能性があることに同意のうえ、
            本サービスを利用するものとします。
          </div>
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          20. プライバシーポリシー
        </div>
        <div class="text-color pt-3">
          当社は、ユーザーから取得した情報（個人情報を含みます）を、
          当社プライバシーポリシーにしたがって取り扱います。ユーザーが本サービスをご利用になる際には、
          事前にプライバシーポリシー を熟読していただき、すべての内容について同意したうえで利用するものとします。
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          21. 通信の秘密
        </div>
        <div class="text-color pt-3">
          当社は、ユーザーの通信の秘密を守って、ユーザーの通信内容や通信履歴を取扱います。
          なお、当社は、ユーザーの同意を得た場合や法令により強制または許容される場合に、
          ユーザーの通信内容や通信履歴を閲覧し、捜査機関等の第三者に開⽰し、または削除することがあります。
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          22. 反社会的勢力に該当しないこと
        </div>
        <div class="text-color pt-3">
          当社とユーザーとは、相手方に対し、自己およびその代表者、役員、その他、
          実質的に経営を有する者が、現在、暴力団、暴力団員、暴力団準構成員、暴力団関係企業、
          総会屋、社会運動標ぼうゴロ、政治活動標ぼうゴロ、特殊知能暴力集団、
          これらの者と密接な関係を有する者またはこれらに準じる者のいずれにも該当しないことを表明し、
          かつ、将来にわたっても該当しないことを確約するものとします。
        </div>
        <div class="subheading font-weight-bold text-color pt-5">
          23. 準拠法・管轄合意
        </div>
        <div class="text-color pt-3">
          当社とユーザーとの契約関係は、日本法を準拠法とします。
          本サービスに関連して当社とユーザーとの間で生じた紛争については東京地方裁判所を第一審の専属的合意管轄裁判所とします。
        </div>
      </div>
      <div class="text-color pt-5">
        最終改定日：2019年6月29日
      </div>
    </v-flex>
  </v-layout>
</template>

<script>
import { mapActions, mapState } from 'vuex'

export default {
  head () {
    return {
      title: '利用規約',
      meta: [
        { hid: 'description', name: 'description', content: null },
        { hid: 'og:type', property: 'og:type', content: 'article' },
        { hid: 'og:title', property: 'og:title', content: '利用規約' + ' - Liplo' },
        { hid: 'og:description', property: 'og:description', content: null },
        { hid: 'og:url', property: 'og:url', content: 'https://liplo.jp' + this.$route.path },
      ],
    }
  },
  computed: {
    breakpoint() {
      return this.$vuetify.breakpoint.name
    },
    ...mapState({
      isRefreshing: state => state.isRefreshing,
    })
  },
}
</script>
